[
  {
    "id": 0,
    "name": "Oh My Food",
    "description": "Quatrième projet du parcours. Je joue le rôle d'un développeur junior au sein d'une jeune startup qui voudrais s'imposer sur le marché de la restauration. Ma mission est de développer un site responsive en mobile first qui répertorie les menus de restaurants gastronomiques. L'UX designer à mis a disposition les maquettes mobile et desktop sur Figma. Je dois également intégrer un loader ainsi que des animations pour la mise en favoris et le sélecteur de plat.",
    "skills": ["HTML", "CSS", "Animations", "Mobile First", "GitHub"],
    "link": "https://github.com/efilser/Ohmyfood"
  },

  {
    "id": 1,
    "name": "Kasa",
    "description": "Huitième projet du parcours. Dans ce scénario, Kasa, une entreprise de location d'appartements entre particulier depuis près de 10 ans me recrute en tant que développeur front-end en freelance. Le projet est une refonte totale du site de Kasa afin de passer à une stack complète en JavaScript. Ma mission est de m'occuper du côté front-end avec React en suivant les maquettes responsives Figma et en gérant les routes avec React Router. En termes de fonctionnalités il faudra un carrousel pour présenter les photos des logements et des collapse pour présenter la description et les équipements des logements ainsi que pour la page à propos.",
    "skills": ["HTML", "CSS", "JavaScript", "React"],
    "link": "https://github.com/efilser/kasa"
  },

  {
    "id": 2,
    "name": "Nina Carducci",
    "description": "Neuvième projet du parcours. Je suis cette fois un développeur freelance qui propose ses services d'optimisation SEO. Nina Carducci, une photographe, est intéressée par mes services. Mes missions seront d'améliorer les performances de son site notamment en optimisant ses images (redimensionnement, changement de format, compression), optimiser le code et sa structure pour améliorer le chargement et l'accessibilité (utilisation de preconnect, preload, lazy loading, code minifié, utilisation de balises sémantiques cohérentes…), mettre en place le référencement local en utilisant Schema.org, ajouter les metas pour les réseaux sociaux. Enfin je devais présenter un rapport d'optimisation avant/après en utilisant les données d'audit Lighthouse, Wave et Rich Snippet.",
    "skills": ["Optimisations", "SEO", "Audit"],
    "link": "https://github.com/efilser/nina-carducci"
  },

  {
    "id": 3,
    "name": "Argent Bank",
    "description": "Onizème et avant dernier projet du parcours. Il s'agit ici d'une web application pour une nouvelle banque en ligne qui souhaite percer dans le secteur bancaire. En tant que développeur front-end, j'ai pour mission de créer cette application en utilisant React et Redux pour la gestion du state. Les fonctionnalités demandés sont de pouvoir se connecter et se déconnecter d'un compte client via une API. Une fois authentifié, on doit récupérer et afficher les informations du compte et l'utilisateur doit pouvoir modifier son pseudonyme. Enfin il faut protéger la route d'accès au profile pour qu'elle ne soit accessible qu'à un utilisateur authentifié.",
    "skills": ["React", "Redux", "Swagger"],
    "link": "https://github.com/efilser/argentbank"
  }
]
